# coding:utf-8
from mongoengine import *
import numpy as np
# Create your models here.
from mongoengine import connect
disconnect()
connect('MS_data', host='202.121.180.66', port=7101)
class MSAJ(Document):
    标题 = StringField()
    案号 = StringField()
    案件类型 = StringField()
    庭审程序 = StringField()
    案由 = StringField()
    文书类型 = StringField()
    法院 = StringField()
    判决日期 = StringField()
    原告 = StringField()
    被告 = StringField()
    第三人 = StringField()
    法官 = StringField()
    审判长 = StringField()
    审判员 = StringField()
    书记员 = StringField()
    头部 = StringField()
    头部2 = StringField()
    当事人 = StringField()
    当事人2 = StringField()
    庭审程序说明 = StringField()
    庭审程序说明2 = StringField()
    庭审过程 = StringField()
    庭审过程2 = StringField()
    庭审过程3 = StringField()
    庭审过程4 = StringField()
    庭审过程5 = StringField()
    庭审过程6 = StringField()
    法院意见 = StringField()
    法院意见2 = StringField()
    判决结果 = StringField()
    判决结果2 = StringField()
    庭后告知 = StringField()
    庭后告知2 = StringField()
    结尾 = StringField()
    结尾2 = StringField()
    附录 = StringField()
    附录2 = StringField()
    meta = {
        'collection':'MS_law_data'
    }


class MsData:
    def __init__(self):
        pass

    #获得数据库中各地区法院的案件数量
    def get_court_case_number(self):
        court_case_number = []
        court_list = []
        for i in MSAJ.objects:
            meta_court_case_number = {}
            region_demo = i.法院.split('市')[1].split('区')[0]
            if len(region_demo) > 3:
                region = region_demo
            else:
                region = region_demo + '区'
            # print(region)
            if region not in court_list:
                meta_court_case_number['name'] = region
                meta_court_case_number['value'] = 1
                court_list.append(region)
                court_case_number.append(meta_court_case_number)
            else:
                for j in court_case_number:
                    if j['name'] == region:
                        j['value'] = j['value'] + 1

    def get_case_info(self):
        case_info = {}
        case_number = MSAJ.objects.count()
        people_number = 2 * case_number
        map = [{'name': '合川区', 'value': 23940}, {'name': '渝中区', 'value': 8514}, {'name': '北碚区', 'value': 15363},
                {'name': '渝北区', 'value': 6386}, {'name': '涪陵区', 'value': 5930}, {'name': '万州区', 'value': 6501}]
        date = ['2005年', '2006年', '2007年', '2008年', '2009年', '2010年', '2011年', '2012年', '2013年', '2014年', '2015年', '2016年', '2017年', '2018年', '2019年']
        date_number = [31, 27, 14, 52, 226, 83, 461, 379, 1079, 8598, 10822, 11803, 14055, 17313, 1677]
        region = []
        region_number = []
        date_case_number = [{
            'name': '民事案件',
            'data': date_number,
        }]
        for i in map:
            region.append(i['name'])
            region_number.append(i['value'])
        case_info['case_number'] = case_number
        case_info['people_number'] = people_number
        case_info['map'] = map
        case_info['region_case_number'] = [region, region_number]
        case_info['date_case_number'] = [date, date_case_number]
        return case_info

    def get_detail_info(self):
        MSCASE = {
            'mscase_id': [],
            'mscase_title': [],
            'mscase_detail': [],
        }
        for i in MSAJ.objects.limit(10):
            # print(type(str(i.id)))
            MSCASE['mscase_id'].append(str(i.id))
            MSCASE['mscase_title'].append(i.标题)
            MSCASE['mscase_detail'].append(i.庭审过程)
        return MSCASE

    def get_ay_info(self):
        mscase_info = {
            '案外人执行异议之诉': 334, '保安服务合同纠纷': 4, '保险代理合同纠纷': 5, '保险纠纷': 267, '保险人代位求偿权纠纷': 94, '保证保险合同纠纷': 40,
            '被继承人债务清偿纠纷': 33, '变更扶养关系纠纷': 3, '变更抚养关系纠纷': 152, '殡葬服务合同纠纷': 1, '不明抛掷物、坠落物损害责任纠纷': 1, '不正当竞争纠纷': 15,
            '财产保险合同纠纷': 211, '财产损害赔偿纠纷': 851, '财产损失保险合同纠纷': 12, '产品生产者责任纠纷': 11, '产品销售者责任纠纷': 616, '产品责任纠纷': 1413,
            '车位纠纷': 8, '撤销婚姻纠纷': 1, '承包地征收补偿费用分配纠纷': 102, '出版合同纠纷': 2, '触电人身损害责任纠纷': 16, '代位继承纠纷': 1, '担保物权纠纷': 31,
            '担保物权确认纠纷': 2, '抵押权纠纷': 10, '地面施工、地下设施损害责任纠纷': 6, '电信服务合同纠纷': 241, '对外追收债权纠纷': 40, '法定继承纠纷': 356,
            '法律服务合同纠纷': 21, '返还原物纠纷': 598, '房地产咨询合同纠纷': 6, '房屋买卖合同纠纷': 1255, '分家析产纠纷': 160, '夫妻财产约定纠纷': 2, '扶养费纠纷': 35,
            '扶养纠纷': 8, '服务合同纠纷': 54, '福利待遇纠纷': 167, '抚养费纠纷': 276, '抚养纠纷': 32, '工伤保险待遇纠纷': 496, '公共场所管理人责任纠纷': 6,
            '公共道路妨碍通行损害责任纠纷': 10, '公司分立纠纷': 2, '公司解散纠纷': 29, '公司决议撤销纠纷': 13, '公司决议纠纷': 11, '公司决议效力确认纠纷': 23,
            '公司盈余分配纠纷': 20, '公司证照返还纠纷': 12, '公证损害责任纠纷': 9, '共有纠纷': 117, '共有权确认纠纷': 19, '共有人优先购买权纠纷': 2, '共有物分割纠纷': 147,
            '股东出资纠纷': 37, '股东损害公司债权人利益责任纠纷': 41, '股东知情权纠纷': 25, '股东资格确认纠纷': 180, '股票权利确认纠纷': 3, '股权转让纠纷': 438,
            '挂靠经营合同纠纷': 843, '合伙企业财产份额转让纠纷': 5, '合伙企业纠纷': 64, '恢复原状纠纷': 133, '婚姻家庭纠纷': 41, '婚姻无效纠纷': 13, '婚约财产纠纷': 24,
            '机动车交通事故责任纠纷': 5635, '技术服务合同纠纷': 12, '技术咨询合同纠纷': 4, '继承纠纷': 444, '家政服务合同纠纷': 2, '监护权纠纷': 7, '监护人责任纠纷': 12,
            '建设用地使用权纠纷': 8, '建筑物、构筑物倒塌损害责任纠纷': 6, '建筑物区分所有权纠纷': 70, '健康保险合同纠纷': 6, '教育机构责任纠纷': 12, '教育培训合同纠纷': 14,
            '解除收养关系纠纷': 9, '借款合同纠纷': 341, '金融借款合同纠纷': 1551, '金融衍生品种交易纠纷': 5, '经济补偿金纠纷': 473, '经济适用房转让合同纠纷': 3,
            '竞业限制纠纷': 3, '劳动合同纠纷': 1285, '劳动争议': 3398, '离婚后财产纠纷': 547, '离婚后损害责任纠纷': 6, '离婚纠纷': 4678, '联营合同纠纷': 62,
            '旅店服务合同纠纷': 6, '旅游合同纠纷': 7, '买卖合同纠纷': 1173, '民间借贷纠纷': 4657, '名誉权纠纷': 149, '农村房屋买卖合同纠纷': 18, '排除妨害纠纷': 469,
            '票据返还请求权纠纷': 2, '票据付款请求权纠纷': 12, '票据纠纷': 118, '票据利益返还请求权纠纷': 18, '票据损害责任纠纷': 2, '票据追索权纠纷': 5, '破产撤销权纠纷': 4,
            '破产债权确认纠纷': 3, '普通破产债权确认纠纷': 33, '期货交易纠纷': 3, '企业承包经营合同纠纷': 46, '企业出售合同纠纷': 17, '企业出资人权益确认纠纷': 10,
            '企业公司制改造合同纠纷': 2, '企业借贷纠纷': 17, '企业租赁经营合同纠纷': 10, '侵害集体经济组织成员权益纠纷': 213, '侵害其他著作财产权纠纷': 63,
            '侵害企业出资人权益纠纷': 8, '侵害企业名称（商号）权纠纷': 1, '侵害商标权纠纷': 206, '侵害商业秘密纠纷': 6, '侵害作品发表权纠纷': 20, '侵害作品放映权纠纷': 209,
            '侵害作品复制权纠纷': 12, '侵害作品信息网络传播权纠纷': 23, '侵害作品展览权纠纷': 1, '侵权责任纠纷': 247, '清算责任纠纷': 6, '请求变更公司登记纠纷': 9,
            '请求撤销个别清偿行为纠纷': 80, '请求公司收购股份纠纷': 1, '庆典服务合同纠纷': 1, '确认劳动关系纠纷': 477, '确认票据无效纠纷': 225, '人格权纠纷': 4,
            '人身保险合同纠纷': 146, '人身自由权纠纷': 1, '人事争议': 21, '人寿保险合同纠纷': 18, '荣誉权纠纷': 1, '赡养费纠纷': 219, '赡养纠纷': 198,
            '商标代理合同纠纷': 1, '商标权权属、侵权纠纷': 49, '商标权转让合同纠纷': 2, '商标使用许可合同纠纷': 3, '商品房委托代理销售合同纠纷': 3, '商品房销售合同纠纷': 2092,
            '商品房预售合同纠纷': 933, '商品房预约合同纠纷': 110, '社会保险纠纷': 145, '申请保全案件': 9, '申请变更监护人': 21, '申请撤销监护人资格': 11,
            '申请撤销宣告公民死亡': 11, '申请撤销宣告失踪': 1, '申请公示催告': 102, '申请公司清算': 12, '申请拍卖扣押船舶': 104, '申请破产和解': 1, '申请破产清算': 103,
            '申请破产重整': 25, '申请确定监护人': 19, '申请诉前财产保全': 1823, '申请为失踪人财产指定、变更代管人': 3, '申请宣告公民恢复完全民事行为能力': 7, '申请宣告公民失踪': 70,
            '申请宣告公民死亡': 289, '申请宣告公民无民事行为能力': 391, '申请宣告公民限制民事行为能力': 79, '申请支付令': 169, '申请执行人执行异议之诉': 462,
            '生命权、健康权、身体权纠纷': 2228, '生育保险待遇纠纷': 3, '失业保险待遇纠纷': 171, '收养关系纠纷': 5, '水污染责任纠纷': 38, '饲养动物损害责任纠纷': 47,
            '损害公司利益责任纠纷': 32, '损害股东利益责任纠纷': 25, '所有权纠纷': 274, '所有权确认纠纷': 380, '探望权纠纷': 32, '特许经营合同纠纷': 44,
            '提供劳务者受害责任纠纷': 823, '提供劳务者致害责任纠纷': 16, '同居关系纠纷': 18, '同居关系析产纠纷': 38, '同居关系子女抚养纠纷': 1776, '土地承包经营权继承纠纷': 4,
            '土地承包经营权纠纷': 286, '土地承包经营权确认纠纷': 31, '退伙纠纷': 18, '网络服务合同纠纷': 3, '网络购物合同纠纷': 4, '网络侵权责任纠纷': 6,
            '网络域名注册合同纠纷': 8, '违反安全保障义务责任纠纷': 94, '伪造、冒用产品质量标志纠纷': 64, '物件损害责任纠纷': 12, '物件脱落、坠落损害责任纠纷': 12,
            '物权保护纠纷': 303, '物权确认纠纷': 141, '物业服务合同纠纷': 9503, '相邻采光、日照纠纷': 1, '相邻关系纠纷': 194, '相邻损害防免关系纠纷': 16,
            '相邻通行纠纷': 8, '相邻土地、建筑物利用关系纠纷': 3, '相邻污染侵害纠纷': 1, '相邻用水、排水纠纷': 5, '肖像权纠纷': 16, '小额借款合同纠纷': 38, '新增资本认购纠纷': 7,
            '信托纠纷': 1, '姓名权纠纷': 11, '修理、重作、更换纠纷': 1, '虚假登记损害责任纠纷': 3, '养老保险待遇纠纷': 98, '业主撤销权纠纷': 11, '业主共有权纠纷': 25,
            '业主知情权纠纷': 8, '一般取回权纠纷': 3, '一般人格权纠纷': 43, '医疗保险待遇纠纷': 49, '医疗服务合同纠纷': 44, '医疗损害责任纠纷': 291, '遗失物返还纠纷': 4,
            '遗赠扶养协议纠纷': 7, '遗赠纠纷': 3, '遗嘱继承纠纷': 44, '义务帮工人受害责任纠纷': 18, '意外伤害保险合同纠纷': 47, '因申请诉前财产保全损害责任纠纷': 33,
            '因申请诉中财产保全损害责任纠纷': 10, '因申请先予执行损害责任纠纷': 2, '隐私权纠纷': 2, '用益物权纠纷': 5, '用益物权确认纠纷': 4, '邮寄服务合同纠纷': 1,
            '与公司有关的纠纷': 63, '与破产有关的纠纷': 2, '责任保险合同纠纷': 41, '宅基地使用权纠纷': 9, '占有排除妨害纠纷': 6, '占有物返还纠纷': 24, '占有物损害赔偿纠纷': 2,
            '证券纠纷': 8, '执行分配方案异议之诉': 18, '执行异议之诉': 7, '职工破产债权确认纠纷': 15, '质权纠纷': 1, '中外合作经营企业合同纠纷': 1, '仲裁程序中的财产保全': 60,
            '著作权合同纠纷': 8, '著作权权属、侵权纠纷': 409, '著作权权属纠纷': 105, '著作权许可使用合同纠纷': 2, '追索劳动报酬纠纷': 1959, '保管合同纠纷': 6,
            '保险费纠纷': 1, '保证合同纠纷': 7, '不当得利纠纷': 10, '财会服务合同纠纷': 1, '车辆租赁合同纠纷': 6, '承揽合同纠纷': 22, '储蓄存款合同纠纷': 1,
            '抵押合同纠纷': 1, '定金合同纠纷': 1, '定作合同纠纷': 1, '发明专利实施许可合同纠纷': 3, '房屋拆迁安置补偿合同纠纷': 36, '房屋租赁合同纠纷': 93, '仿冒纠纷': 1,
            '分期付款买卖合同纠纷': 2, '附义务赠与合同纠纷': 1, '高度危险活动损害责任纠纷': 2, '公路货物运输合同纠纷': 8, '公路旅客运输合同纠纷': 2, '公司设立纠纷': 2,
            '公司债券回购合同纠纷': 5, '供用电合同纠纷': 1, '供用水合同纠纷': 1, '股权质权纠纷': 1, '广告合同纠纷': 1, '合伙协议纠纷': 42, '合同、无因管理、不当得利纠纷': 1,
            '合同纠纷': 84, '合资、合作开发房地产合同纠纷': 7, '环境污染责任纠纷': 30, '计算机软件开发合同纠纷': 1, '计算机软件著作权许可使用合同纠纷': 1, '技术合同纠纷': 13,
            '技术合作开发合同纠纷': 2, '技术秘密许可使用合同纠纷': 1, '技术培训合同纠纷': 1, '技术委托开发合同纠纷': 2, '技术转让合同纠纷': 6, '加工合同纠纷': 3,
            '建设工程分包合同纠纷': 10, '建设工程合同纠纷': 18, '建设工程设计合同纠纷': 1, '建设工程施工合同纠纷': 148, '建设用地使用权出让合同纠纷': 3,
            '建设用地使用权转让合同纠纷': 2, '建筑设备租赁合同纠纷': 28, '借记卡纠纷': 1, '借用合同纠纷': 1, '金融不良债权追偿纠纷': 2, '居间合同纠纷': 5, '劳务合同纠纷': 68,
            '林木折断损害责任纠纷': 1, '林业承包合同纠纷': 5, '临时用地合同纠纷': 1, '农村建房施工合同纠纷': 4, '农村土地承包合同纠纷': 26, '农业承包合同纠纷': 4,
            '期货交易代理合同纠纷': 1, '企业股份合作制改造合同纠纷': 9, '企业兼并合同纠纷': 6, '侵害发明专利权纠纷': 15, '侵害计算机软件著作权纠纷': 16, '侵害技术秘密纠纷': 2,
            '侵害实用新型专利权纠纷': 24, '侵害外观设计专利权纠纷': 33, '侵害网络域名纠纷': 1, '请求确认人民调解协议效力': 43, '取回权纠纷': 1, '取水权纠纷': 1,
            '确认不侵害专利权纠纷': 3, '确认合同无效纠纷': 24, '确认合同效力纠纷': 9, '确认合同有效纠纷': 4, '确认收养关系纠纷': 3, '擅自使用他人企业名称、姓名纠纷': 1,
            '擅自使用知名商品特有名称、包装、装潢纠纷': 1, '商标权权属纠纷': 4, '商业诋毁纠纷': 2, '商业贿赂不正当竞争纠纷': 2, '申请撤销仲裁裁决': 2, '申请确认仲裁协议效力': 6,
            '申请诉前证据保全': 1, '申请诉中财产保全': 8, '申请诉中证据保全': 1, '诉讼、仲裁、人民调解代理合同纠纷': 4, '土地承包经营权出租合同纠纷': 23, '土地承包经营权互换合同纠纷': 1,
            '土地承包经营权转包合同纠纷': 5, '土地承包经营权转让合同纠纷': 6, '土地租赁合同纠纷': 3, '土壤污染责任纠纷': 2, '网络域名权属纠纷': 1, '委托创作合同纠纷': 3,
            '委托合同纠纷': 9, '物权纠纷': 2, '乡镇企业承包经营合同纠纷': 2, '信用卡纠纷': 14, '信用证纠纷': 1, '信用证开证纠纷': 1, '修理合同纠纷': 3, '虚假宣传纠纷': 4,
            '医疗产品责任纠纷': 2, '因恶意提起知识产权诉讼损害责任纠纷': 1, '用人单位责任纠纷': 4, '渔业承包合同纠纷': 2, '与企业有关的纠纷': 1, '运输合同纠纷': 3,
            '噪声污染责任纠纷': 2, '赠与合同纠纷': 6, '债权人撤销权纠纷': 7, '债权人代位权纠纷': 1, '债权债务概括转移合同纠纷': 1, '债权转让合同纠纷': 8, '债务转移合同纠纷': 1,
            '占有保护纠纷': 1, '招标投标买卖合同纠纷': 1, '证券虚假陈述责任纠纷': 3, '知识产权合同纠纷': 1, '职务发明创造发明人、设计人奖励、报酬纠纷': 4, '植物新品种实施许可合同纠纷': 1,
            '质押式证券回购纠纷': 2, '中外合资经营企业合同纠纷': 1, '种植、养殖回收合同纠纷': 1, '专利合同纠纷': 2, '专利权权属、侵权纠纷': 48, '专利权权属纠纷': 13,
            '专利权转让合同纠纷': 1, '专利申请权转让合同纠纷': 3, '装饰装修合同纠纷': 14, '追偿权纠纷': 70, '追收未缴出资纠纷': 3, '租赁合同纠纷': 53
        }
        ay_info = []
        ay_meta_info = {}
        name = []
        num = []
        for i in sorted(mscase_info.items(), key=lambda x: x[1], reverse=True):
            name.append(i[0])
            num.append(i[1])
        # sort = sorted(mscase_info.items(), key=lambda x: x[1], reverse=True)[:11]
        name = name[:50]
        num = num[:50]
        data = []
        for i in range(6):
            meta_data = {}
            meta_data['name'] = name[i]
            meta_data['value'] = num[i]
            data.append(meta_data)
        ay_meta_info['name'] = '民事案由'
        ay_meta_info['data'] = data
        ay_info.append(ay_meta_info)
        return ay_info


mscase_info = MsData().get_case_info()
mscase = MsData().get_detail_info()
msay_info = MsData().get_ay_info()
# # 民事案由
# MSAY = [
#     '案外人执行异议之诉', '保安服务合同纠纷', '保险代理合同纠纷', '保险纠纷', '保险人代位求偿权纠纷', '保证保险合同纠纷', '被继承人债务清偿纠纷', '变更扶养关系纠纷', '变更抚养关系纠纷', '殡葬服务合同纠纷', '不明抛掷物、坠落物损害责任纠纷', '不正当竞争纠纷', '财产保险合同纠纷', '财产损害赔偿纠纷', '财产损失保险合同纠纷', '产品生产者责任纠纷', '产品销售者责任纠纷', '产品责任纠纷', '车位纠纷', '撤销婚姻纠纷', '承包地征收补偿费用分配纠纷', '出版合同纠纷', '触电人身损害责任纠纷', '代位继承纠纷', '担保物权纠纷', '担保物权确认纠纷', '抵押权纠纷', '地面施工、地下设施损害责任纠纷', '电信服务合同纠纷', '对外追收债权纠纷', '法定继承纠纷', '法律服务合同纠纷', '返还原物纠纷', '房地产咨询合同纠纷', '房屋买卖合同纠纷', '分家析产纠纷', '夫妻财产约定纠纷', '扶养费纠纷', '扶养纠纷', '服务合同纠纷', '福利待遇纠纷', '抚养费纠纷', '抚养纠纷', '工伤保险待遇纠纷', '公共场所管理人责任纠纷', '公共道路妨碍通行损害责任纠纷', '公司分立纠纷', '公司解散纠纷', '公司决议撤销纠纷', '公司决议纠纷', '公司决议效力确认纠纷', '公司盈余分配纠纷', '公司证照返还纠纷', '公证损害责任纠纷', '共有纠纷', '共有权确认纠纷', '共有人优先购买权纠纷', '共有物分割纠纷', '股东出资纠纷', '股东损害公司债权人利益责任纠纷', '股东知情权纠纷', '股东资格确认纠纷', '股票权利确认纠纷', '股权转让纠纷', '挂靠经营合同纠纷', '合伙企业财产份额转让纠纷', '合伙企业纠纷', '恢复原状纠纷', '婚姻家庭纠纷', '婚姻无效纠纷', '婚约财产纠纷', '机动车交通事故责任纠纷', '技术服务合同纠纷', '技术咨询合同纠纷', '继承纠纷', '家政服务合同纠纷', '监护权纠纷', '监护人责任纠纷', '建设用地使用权纠纷', '建筑物、构筑物倒塌损害责任纠纷', '建筑物区分所有权纠纷', '健康保险合同纠纷', '教育机构责任纠纷', '教育培训合同纠纷', '解除收养关系纠纷', '借款合同纠纷', '金融借款合同纠纷', '金融衍生品种交易纠纷', '经济补偿金纠纷', '经济适用房转让合同纠纷', '竞业限制纠纷', '劳动合同纠纷', '劳动争议', '离婚后财产纠纷', '离婚后损害责任纠纷', '离婚纠纷', '联营合同纠纷', '旅店服务合同纠纷', '旅游合同纠纷', '买卖合同纠纷', '民间借贷纠纷', '名誉权纠纷', '农村房屋买卖合同纠纷', '排除妨害纠纷', '票据返还请求权纠纷', '票据付款请求权纠纷', '票据纠纷', '票据利益返还请求权纠纷', '票据损害责任纠纷', '票据追索权纠纷', '破产撤销权纠纷', '破产债权确认纠纷', '普通破产债权确认纠纷', '期货交易纠纷', '企业承包经营合同纠纷', '企业出售合同纠纷', '企业出资人权益确认纠纷', '企业公司制改造合同纠纷', '企业借贷纠纷', '企业租赁经营合同纠纷', '侵害集体经济组织成员权益纠纷', '侵害其他著作财产权纠纷', '侵害企业出资人权益纠纷', '侵害企业名称（商号）权纠纷', '侵害商标权纠纷', '侵害商业秘密纠纷', '侵害作品发表权纠纷', '侵害作品放映权纠纷', '侵害作品复制权纠纷', '侵害作品信息网络传播权纠纷', '侵害作品展览权纠纷', '侵权责任纠纷', '清算责任纠纷', '请求变更公司登记纠纷', '请求撤销个别清偿行为纠纷', '请求公司收购股份纠纷', '庆典服务合同纠纷', '确认劳动关系纠纷', '确认票据无效纠纷', '人格权纠纷', '人身保险合同纠纷', '人身自由权纠纷', '人事争议', '人寿保险合同纠纷', '荣誉权纠纷', '赡养费纠纷', '赡养纠纷', '商标代理合同纠纷', '商标权权属、侵权纠纷', '商标权转让合同纠纷', '商标使用许可合同纠纷', '商品房委托代理销售合同纠纷', '商品房销售合同纠纷', '商品房预售合同纠纷', '商品房预约合同纠纷', '社会保险纠纷', '申请保全案件', '申请变更监护人', '申请撤销监护人资格', '申请撤销宣告公民死亡', '申请撤销宣告失踪', '申请公示催告', '申请公司清算', '申请拍卖扣押船舶', '申请破产和解', '申请破产清算', '申请破产重整', '申请确定监护人', '申请诉前财产保全', '申请为失踪人财产指定、变更代管人', '申请宣告公民恢复完全民事行为能力', '申请宣告公民失踪', '申请宣告公民死亡', '申请宣告公民无民事行为能力', '申请宣告公民限制民事行为能力', '申请支付令', '申请执行人执行异议之诉', '生命权、健康权、身体权纠纷', '生育保险待遇纠纷', '失业保险待遇纠纷', '收养关系纠纷', '水污染责任纠纷', '饲养动物损害责任纠纷', '损害公司利益责任纠纷', '损害股东利益责任纠纷', '所有权纠纷', '所有权确认纠纷', '探望权纠纷', '特许经营合同纠纷', '提供劳务者受害责任纠纷', '提供劳务者致害责任纠纷', '同居关系纠纷', '同居关系析产纠纷', '同居关系子女抚养纠纷', '土地承包经营权继承纠纷', '土地承包经营权纠纷', '土地承包经营权确认纠纷', '退伙纠纷', '网络服务合同纠纷', '网络购物合同纠纷', '网络侵权责任纠纷', '网络域名注册合同纠纷', '违反安全保障义务责任纠纷', '伪造、冒用产品质量标志纠纷', '物件损害责任纠纷', '物件脱落、坠落损害责任纠纷', '物权保护纠纷', '物权确认纠纷', '物业服务合同纠纷', '相邻采光、日照纠纷', '相邻关系纠纷', '相邻损害防免关系纠纷', '相邻通行纠纷', '相邻土地、建筑物利用关系纠纷', '相邻污染侵害纠纷', '相邻用水、排水纠纷', '肖像权纠纷', '小额借款合同纠纷', '新增资本认购纠纷', '信托纠纷', '姓名权纠纷', '修理、重作、更换纠纷', '虚假登记损害责任纠纷', '养老保险待遇纠纷', '业主撤销权纠纷', '业主共有权纠纷', '业主知情权纠纷', '一般取回权纠纷', '一般人格权纠纷', '医疗保险待遇纠纷', '医疗服务合同纠纷', '医疗损害责任纠纷', '遗失物返还纠纷', '遗赠扶养协议纠纷', '遗赠纠纷', '遗嘱继承纠纷', '义务帮工人受害责任纠纷', '意外伤害保险合同纠纷', '因申请诉前财产保全损害责任纠纷', '因申请诉中财产保全损害责任纠纷', '因申请先予执行损害责任纠纷', '隐私权纠纷', '用益物权纠纷', '用益物权确认纠纷', '邮寄服务合同纠纷', '与公司有关的纠纷', '与破产有关的纠纷', '责任保险合同纠纷', '宅基地使用权纠纷', '占有排除妨害纠纷', '占有物返还纠纷', '占有物损害赔偿纠纷', '证券纠纷', '执行分配方案异议之诉', '执行异议之诉', '职工破产债权确认纠纷', '质权纠纷', '中外合作经营企业合同纠纷', '仲裁程序中的财产保全', '著作权合同纠纷', '著作权权属、侵权纠纷', '著作权权属纠纷', '著作权许可使用合同纠纷', '追索劳动报酬纠纷', '保管合同纠纷', '保险费纠纷', '保证合同纠纷', '不当得利纠纷', '财会服务合同纠纷', '车辆租赁合同纠纷', '承揽合同纠纷', '储蓄存款合同纠纷', '抵押合同纠纷', '定金合同纠纷', '定作合同纠纷', '发明专利实施许可合同纠纷', '房屋拆迁安置补偿合同纠纷', '房屋租赁合同纠纷', '仿冒纠纷', '分期付款买卖合同纠纷', '附义务赠与合同纠纷', '高度危险活动损害责任纠纷', '公路货物运输合同纠纷', '公路旅客运输合同纠纷', '公司设立纠纷', '公司债券回购合同纠纷', '供用电合同纠纷', '供用水合同纠纷', '股权质权纠纷', '广告合同纠纷', '合伙协议纠纷', '合同、无因管理、不当得利纠纷', '合同纠纷', '合资、合作开发房地产合同纠纷', '环境污染责任纠纷', '计算机软件开发合同纠纷', '计算机软件著作权许可使用合同纠纷', '技术合同纠纷', '技术合作开发合同纠纷', '技术秘密许可使用合同纠纷', '技术培训合同纠纷', '技术委托开发合同纠纷', '技术转让合同纠纷', '加工合同纠纷', '建设工程分包合同纠纷', '建设工程合同纠纷', '建设工程设计合同纠纷', '建设工程施工合同纠纷', '建设用地使用权出让合同纠纷', '建设用地使用权转让合同纠纷', '建筑设备租赁合同纠纷', '借记卡纠纷', '借用合同纠纷', '金融不良债权追偿纠纷', '居间合同纠纷', '劳务合同纠纷', '林木折断损害责任纠纷', '林业承包合同纠纷', '临时用地合同纠纷', '农村建房施工合同纠纷', '农村土地承包合同纠纷', '农业承包合同纠纷', '期货交易代理合同纠纷', '企业股份合作制改造合同纠纷', '企业兼并合同纠纷', '侵害发明专利权纠纷', '侵害计算机软件著作权纠纷', '侵害技术秘密纠纷', '侵害实用新型专利权纠纷', '侵害外观设计专利权纠纷', '侵害网络域名纠纷', '请求确认人民调解协议效力', '取回权纠纷', '取水权纠纷', '确认不侵害专利权纠纷', '确认合同无效纠纷', '确认合同效力纠纷', '确认合同有效纠纷', '确认收养关系纠纷', '擅自使用他人企业名称、姓名纠纷', '擅自使用知名商品特有名称、包装、装潢纠纷', '商标权权属纠纷', '商业诋毁纠纷', '商业贿赂不正当竞争纠纷', '申请撤销仲裁裁决', '申请确认仲裁协议效力', '申请诉前证据保全', '申请诉中财产保全', '申请诉中证据保全', '诉讼、仲裁、人民调解代理合同纠纷', '土地承包经营权出租合同纠纷', '土地承包经营权互换合同纠纷', '土地承包经营权转包合同纠纷', '土地承包经营权转让合同纠纷', '土地租赁合同纠纷', '土壤污染责任纠纷', '网络域名权属纠纷', '委托创作合同纠纷', '委托合同纠纷', '物权纠纷', '乡镇企业承包经营合同纠纷', '信用卡纠纷', '信用证纠纷', '信用证开证纠纷', '修理合同纠纷', '虚假宣传纠纷', '医疗产品责任纠纷', '因恶意提起知识产权诉讼损害责任纠纷', '用人单位责任纠纷', '渔业承包合同纠纷', '与企业有关的纠纷', '运输合同纠纷', '噪声污染责任纠纷', '赠与合同纠纷', '债权人撤销权纠纷', '债权人代位权纠纷', '债权债务概括转移合同纠纷', '债权转让合同纠纷', '债务转移合同纠纷', '占有保护纠纷', '招标投标买卖合同纠纷', '证券虚假陈述责任纠纷', '知识产权合同纠纷', '职务发明创造发明人、设计人奖励、报酬纠纷', '植物新品种实施许可合同纠纷', '质押式证券回购纠纷', '中外合资经营企业合同纠纷', '种植、养殖回收合同纠纷', '专利合同纠纷', '专利权权属、侵权纠纷', '专利权权属纠纷', '专利权转让合同纠纷', '专利申请权转让合同纠纷', '装饰装修合同纠纷', '追偿权纠纷', '追收未缴出资纠纷', '租赁合同纠纷'
# ]
# MSFYSORT = {'合川区': 23940, '渝中区': 8514, '北碚区': 15363,   '高级人民法院': 6386, '涪陵区': 5930, '万州区': 6501,}
# # 文书类型
# MSWS = ['裁定书', '判决书', '其他', '令']
# # 案由案件数









